app/views/templates/_form.html.erb

SELECT "questions".* FROM "questions" WHERE "questions"."template_id" = ?  [["template_id", 6]]
---

  <%= form.submit "Adicionar questão",
                  formaction: question_path(@template.questions.size),
                  formmethod: :post,
                  formnovalidate: true,
                  id: "add-question" %>