app/views/templates/_template.html.erb

<ol>
  <% template.questions.each do |question| %>
---
SELECT "questions".* FROM "questions" WHERE "questions"."template_id" = ?  [["template_id", 4]]