backend/app/controllers/cclasses_controller.rb

SELECT "cclasses".* FROM "cclasses" WHERE "cclasses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_cclass
    @cclass = Cclass.find(params[:id])