backend/app/controllers/cclasses_controller.rb

SELECT "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "enrollments".* FROM "enrollments" WHERE (cclass_id = 4)
SELECT subjects.name, subjects.code as subjectCode, cclasses.* FROM "cclasses" INNER JOIN "subjects" ON "subjects"."id" = "cclasses"."subject_id"
---
  def index
    if !params[:member_id].nil?
      @member = Member.find(params[:member_id])
      if !@member.blank?
        @cclasses = []
        for enrollment in @member.enrollments do
          @cclasses.push(enrollment.cclass)
        end
        render json: @cclasses, include: :subject
        return
      end
    end
    @members = Enrollment.where('cclass_id = 4')
    puts @members
    @cclasses = Cclass.select('subjects.name, subjects.code as subjectCode, cclasses.*').joins(:subject)

SELECT "cclasses".* FROM "cclasses" WHERE "cclasses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @cclass = Cclass.find(params[:id])