backend/app/controllers/members_controller.rb

  def index
    @members = if params[:id].present?
      cclass = Cclass.find(params[:id])
      cclass.members
    else
      Member.all
---
SELECT "cclasses".* FROM "cclasses" WHERE "cclasses"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "members".* FROM "members"