backend/app/controllers/scrapper_controller.rb

SELECT "enrollments".* FROM "enrollments" WHERE "enrollments"."member_id" = ? AND "enrollments"."cclass_id" = ? LIMIT ?  [["member_id", 1], ["cclass_id", 1], ["LIMIT", 1]]
INSERT INTO "cclasses" ("code", "semester", "time", "subject_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["code", "TA"], ["semester", "2021.2"], ["time", "35M12"], ["subject_id", 1], ["created_at", "2022-09-22 11:31:47.765277"], ["updated_at", "2022-09-22 11:31:47.765277"]]
INSERT INTO "enrollments" ("cclass_id", "member_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["cclass_id", 1], ["member_id", 1], ["created_at", "2022-09-22 11:31:47.776430"], ["updated_at", "2022-09-22 11:31:47.776430"]]
INSERT INTO "members" ("name", "registration", "username", "degree", "course", "email", "created_at", "updated_at", "role_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def index
      params = request.body.read
      puts params
      url = 'http://localhost:3030/participantes'
      resultado = RestClient.post(url, params, :content_type => 'application/json', :accept => 'application/json')
      resultado = JSON.parse(resultado.body)
      puts resultado
      resultado.each do |participantes|
        puts participantes['code']
        idMateria = Subject.where(code: participantes['code']).first.id
        turma = Cclass.where(subject_id: idMateria, code: participantes['classCode']).first

        participantes['dicente'].each do |discente|
          member=Member.where(registration: discente['matricula']).first
          if Member.exists?(registration: discente['matricula'])
            if !Enrollment.exists?(member: member, cclass: turma)
              Enrollment.create(member: member, cclass: turma)