backend/app/controllers/surveys_controller.rb

    def set_surveys
      @surveys = Survey.all
---
SELECT "surveys".* FROM "surveys"

    def set_survey
      @survey = Survey.find(params[:id])
---
SELECT "surveys".* FROM "surveys" WHERE "surveys"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]