backend/app/controllers/users_controller.rb

SELECT 1 AS one FROM "members" WHERE "members"."email" = ? LIMIT ?  [["email", "teste@teste.com"], ["LIMIT", 1]]
---
  def create
      email = params[:email_pessoa]
      senha = User.new(:password => params[:senha_pessoa]).encrypted_password
      if Member.exists?(:email=> email) && !User.exists?(:email=> email)