CAAMAR/app/controllers/auth_controller.rb

SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def define_password

    @usuario = Usuario.find(params[:id])