CAAMAR/app/controllers/usuarios_controller.rb

  def create
    print("oh o params ai carai",usuario_params)
    @usuario = Usuario.new(usuario_params)

    respond_to do |format|
      if @usuario.save
---
INSERT INTO "usuarios" ("matricula", "nome", "email", "formacao", "created_at", "updated_at", "senha") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def update
    respond_to do |format|
      if @usuario.update(usuario_params)
---
UPDATE "usuarios" SET "updated_at" = ?, "senha" = ? WHERE "usuarios"."id" = ?  [["updated_at", "2024-06-19 23:56:21.213619"], ["senha", "123enzopeitudaço"], ["id", 31]]