app/controllers/templates_controller.rb

  def index
    @templates = Template.all
---
SELECT "templates".* FROM "templates"

  def create
    @template = Template.new(template_params)

    respond_to do |format|
      if @template.save
---
INSERT INTO "templates" ("title", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["title", "teerr"], ["created_at", "2024-06-10 19:38:09.229130"], ["updated_at", "2024-06-10 19:38:09.229130"]]

  def destroy
    @template.destroy!
---
DELETE FROM "templates" WHERE "templates"."id" = ?  [["id", 1]]

    def set_template
      @template = Template.find(params.expect(:id))
---
SELECT "templates".* FROM "templates" WHERE "templates"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]