camaar/app/controllers/pages_controller.rb

  def home_dicente
    @dicente = Dicente.find_by(user_id: current_user.id)
---
SELECT "dicentes".* FROM "dicentes" WHERE "dicentes"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]

  def home_docente
    @docente = Docente.find_by(user_id: current_user.id)
    if @docente.present?
      # Busca todas as classes do docente incluindo os formulários associados
      @turmas = Turma.where(docente_id: @docente.id).includes(:formularios)
      @turmas = [] unless @turmas.present?

      # Busca os templates, tipos e qualquer outra informação necessária
      @templates = Template.where(docente_id: @docente.id)
      @tipos = Tipo.where(docente_id: @docente.id)
---
SELECT "docentes".* FROM "docentes" WHERE "docentes"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT "templates".* FROM "templates" WHERE "templates"."docente_id" = ?  [["docente_id", 1]]
SELECT "tipos".* FROM "tipos" WHERE "tipos"."docente_id" = ?  [["docente_id", 1]]