camaar/app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."usuario" = ? LIMIT ?  [["usuario", "joao_user"], ["LIMIT", 1]]
---
  def create
    user = User.find_by(usuario: params[:username])