camaar/app/controllers/teste_controller.rb

SELECT "users".* FROM "users" WHERE "users"."usuario" = ? LIMIT ?  [["usuario", "test_user"], ["LIMIT", 1]]
---
  def teste_create
    username = params[:username]
    password = params[:password]

    user = User.find_by(usuario: username)

SELECT "users".* FROM "users" WHERE "users"."usuario" = ? LIMIT ?  [["usuario", "test_user"], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$04$I5rJu0kCjUpYhODtyJFrouTQbdRltqSXATuhQeQVpY7IgtZvDQICW"], ["id", 2]]
---
  def definir_senha
    @username = params[:username]
    @password = params[:new_password]
    @newPassword = params[:new_password_confirmation]

    user = User.find_by(usuario: @username)

    if @password != @newPassword
      flash[:alert] = 'Senha e confirmação de senha não coincidem'
      redirect_to recuperar_senha_path
    elsif @password.length < 1
      flash[:alert] = 'Senha não atende aos critérios de segurança'
      redirect_to recuperar_senha_path
    else
      if user.update(password: @password)